# Lecture 3 - Writing - CS50 SQL harvard

In [13]:
# Let's import the required libraries
import sqlite3
import pandas as pd

# Connect to the database file 
# it will create the file if it doesn't exist
conn = sqlite3.connect('mfa.db')
# MFA stands for the Boston Museum of Fine Arts (MFA)

In [14]:
conn.execute("""
CREATE TABLE "collections" (
    "id" INTEGER,
    "title" TEXT NOT NULL,
    "accession_number" TEXT NOT NULL UNIQUE,
    "acquired" NUMERIC,
    PRIMARY KEY("id")
);
""")

# Commit changes to save the table in the database
conn.commit()

OperationalError: table "collections" already exists

In [6]:
# Let's inspect the schema of the longlist table
pd.read_sql_query(
    "PRAGMA table_info(collections);",
    conn
)

   cid              name     type  notnull dflt_value  pk
0    0                id  INTEGER        0       None   1
1    1             title     TEXT        1       None   0
2    2  accession_number     TEXT        1       None   0
3    3          acquired  NUMERIC        0       None   0

## DELETE

In [7]:
DELETE FROM "collections";

SyntaxError: invalid syntax (1128524535.py, line 1)

In [ ]:
conn.execute('''
DELETE FROM "collections"
WHERE "title" = 'Spring outing';
''')
conn.commit()
pd.read_sql_query('SELECT * FROM collections;', conn)

Empty DataFrame
Columns: [id, title, accession_number, acquired]
Index: []

In [11]:
conn.execute('''
DELETE FROM "collections"
WHERE "acquired" IS NULL;
''')
conn.commit()
pd.read_sql_query('SELECT * FROM collections;', conn)

Empty DataFrame
Columns: [id, title, accession_number, acquired]
Index: []

In [12]:
conn.execute('''
DELETE FROM "collections"
WHERE "acquired" < '1909-01-01';
''')
conn.commit()
pd.read_sql_query('SELECT * FROM collections;', conn)

Empty DataFrame
Columns: [id, title, accession_number, acquired]
Index: []

## UPDATE

Here is the syntax of the update command:

UPDATE table
SET column0 = value0, ...
WHERE condition;

## Triggers

- A trigger is a SQL statement that runs automatically in response to another SQL statement, such as an INSERT, UPDATE, or DELETE.
- Triggers are useful for maintaining data consistency and automating tasks across related tables.

## Soft Deletions

Soft deletion (or a soft delete) means marking data as deleted rather than actually removing it from the database.


For example, we could add a deleted column to the collections table with a default value of 0. To “delete” a row, we would update the deleted column to 1. This way, data can be recovered if needed and maintains a complete historical record.